IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO-WORLD.

DATA DIVISION.
WORKING-STORAGE SECTION.
       01 WS-A PIC 9(38).
       01 WS-B PIC 9(38).
       01 WS-C PIC 9(38).
           
PROCEDURE DIVISION.
       MAIN-PARA.
       PERFORM FIBONACCI-PARA.
       STOP RUN.
       
       FIBONACCI-PARA.
       IF WS-A = 0 THEN 
           PERFORM DISPLAY-PARA
           SET WS-A TO 1 
       END-IF.
       ADD WS-A WS-B GIVING WS-C ON SIZE ERROR STOP RUN.
       PERFORM DISPLAY-PARA.
       SET WS-B TO WS-A
       SET WS-A TO WS-C.
       PERFORM FIBONACCI-PARA.
       
       DISPLAY-PARA.
       DISPLAY WS-A " + " WS-B " = " WS-C.

